Revit 2024 API
ParameterTypeId.ViewScalePulldownImperial Property
 "View Scale"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewScalePulldownImperial { get; }
Visual Basic
Public Shared ReadOnly Property ViewScalePulldownImperial As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewScalePulldownImperial {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace